#Scope: nanosoc_chip_pads
create_supply_set VDDACC_VSS
create_supply_set VDD_VSS

#Domain: ACCEL
create_power_domain ACCEL  -supply {primary VDDACC_VSS}  -elements {u_nanosoc_chip/u_system/u_ss_expansion/u_region_exp/u_ss_accelerator}

#Domain: TOP
create_power_domain TOP  -supply {primary VDD_VSS}

associate_supply_set VDDACC_VSS -handle ACCEL.primary
associate_supply_set VDD_VSS -handle TOP.primary

create_supply_port VDDACC
create_supply_port VDD
create_supply_port VSS

create_supply_net VDDACC
create_supply_net VDD
create_supply_net VSS

connect_supply_net VDD -ports VDD
connect_supply_net VDDACC -ports VDDACC
connect_supply_net VSS -ports VSS


create_supply_set VDDACC_VSS -function {power VDDACC} -function {ground VSS} -update
create_supply_set VDD_VSS  -function {power VDD}  -function {ground VSS}  -update


connect_supply_net VDD -ports u_nanosoc_chip/u_system/u_ss_expansion/u_region_expram_h/u_expram_h/u_sram/u_rf_sp_hdf/VDD
connect_supply_net VDD -ports u_nanosoc_chip/u_system/u_ss_expansion/u_region_expram_l/u_expram_l/u_sram/u_rf_sp_hdf/VDD
connect_supply_net VDD -ports u_nanosoc_chip/u_system/u_ss_cpu/u_region_dmem_0/u_dmem_0/u_sram/u_rf_sp_hdf/VDD
connect_supply_net VDD -ports u_nanosoc_chip/u_system/u_ss_cpu/u_region_imem_0/u_imem_0/u_sram/u_rf_sp_hdf/VDD
connect_supply_net VDD -ports u_nanosoc_chip/u_system/u_ss_cpu/u_region_bootrom_0/u_bootrom_cpu_0/u_bootrom/u_sl_rom/VDDE

connect_supply_net VSS -ports u_nanosoc_chip/u_system/u_ss_cpu/u_region_dmem_0/u_dmem_0/u_sram/u_rf_sp_hdf/VSS
connect_supply_net VSS -ports u_nanosoc_chip/u_system/u_ss_cpu/u_region_imem_0/u_imem_0/u_sram/u_rf_sp_hdf/VSS
connect_supply_net VSS -ports u_nanosoc_chip/u_system/u_ss_expansion/u_region_expram_h/u_expram_h/u_sram/u_rf_sp_hdf/VSS
connect_supply_net VSS -ports u_nanosoc_chip/u_system/u_ss_expansion/u_region_expram_l/u_expram_l/u_sram/u_rf_sp_hdf/VSS
connect_supply_net VSS -ports u_nanosoc_chip/u_system/u_ss_cpu/u_region_bootrom_0/u_bootrom_cpu_0/u_bootrom/u_sl_rom/VSSE

add_port_state VSS -state {state1 0.00}
add_port_state VDD -state {state1 1.08}
add_port_state VDDACC -state {state1 1.08}

create_pst all_pst -supplies { \
    VDDACC \
    VDD \
    VSS}
add_pst_state aon -pst all_pst -state {state1}






