#########################################
# File : Design Import Logic 
# Date : 22nd May 2022 
# Author : Srimanth Tenneti 
# Description : MMMC + Design Import 
######################################### 

### Settting PG Nets 
set init_pwr_net {VDD VDDIO VDDACC}
set init_gnd_net {VSS VSSIO}

### Processing MMMC 
set init_mmmc_file {../scripts/nanosoc.mmmc}

# Set library paths 
# !! EDIT THIS TO YOUR PATHS IN YOUR ENVIRONMENT
set cln28ht_tech_path           /home/dwn1c21/SoC-Labs/phys_ip/arm/tsmc/cln28ht/arm_tech/r1p0
set TECH_LEF                        $cln28ht_tech_path/lef/1p8m_5x2z_utalrdl/sc12mcpp140z_tech.lef

#$::env(PHYS_IP)/arm/tsmc/cln65lp/arm_tech/r2p0/lef/1p9m_6x2z/sc12_tech.lef
set standard_cell_base_path     /home/dwn1c21/SoC-Labs/phys_ip/arm/tsmc/cln28ht/sc12mcpp140z_base_svt_c35/r2p0
set BASE_LEF                  $standard_cell_base_path/lef/sc12mcpp140z_cln28ht_base_svt_c35.lef
set TSMC_28NM_PDK_PATH          /home/dwn1c21/SoC-Labs/phys_ip/TSMC/28
set IO_PAD_DRIVER_LEF     $TSMC_28NM_PDK_PATH/CMOS/HPC+/IO1.8V/iolib/STAGGERED/tphn28hpcpgv18_170d_FE/TSMCHOME/digital/Back_End/lef/tphn28hpcpgv18_110a/mt_2/9lm/lef/tphn28hpcpgv18_9lm.lef
set IO_PAD_LEF /home/dwn1c21/SoC-Labs/phys_ip/TSMC/28/iolib/tpbn28v_160a_FE/TSMCHOME/digital/Back_End/lef/tpbn28v_160a/cup/8m/8M_5X2Z/lef/tpbn28v_8lm.lef


# !! THESE SHOULD BE CORRECT FOR ANY ENVIRONMENT AS THEY ARE GENERATED BY MAKEFILE
set SRAM_LEF $::env(SOCLABS_PROJECT_DIR)/memories/sram_16k/sram_16k.lef
set ROM_LEF $::env(SOCLABS_PROJECT_DIR)/memories/bootrom/rom_via.lef

### Reading LEFs 
set init_lef_file [list ${TECH_LEF} ${BASE_LEF} ${IO_PAD_LEF} ${IO_PAD_DRIVER_LEF} ${SRAM_LEF} ${ROM_LEF}]

### Reading Netlist 
set init_top_cell {nanosoc_chip_pads}
set init_verilog {../outputs/nanosoc_chip_pads_44pin.v}

set init_cpf_file {../outputs/nanosoc_syn_out.cpf}

### Initializing the Design 
init_design

#ungroup u_nanosoc_chip_u_system

floorPlan -coreMarginsBy die -site sc12mcpp140z_cln28ht -d 1666.6666 1666.6666 135 135 135 135

set_db design_process_node 28
### Timing Analysis Type 
set_db timing_analysis_type ocv

# Add Encounter routing option commands in this file

setNanoRouteMode -routeBottomRoutingLayer 2
generateTracks -honorPitch
setNanoRouteMode -routeWithViaInPin true
setNanoRouteMode -routeWithViaOnlyForStandardCellPin true

#Customer is required to source the following placement options in EDI prior to placement 
setPlaceMode  -checkImplantWidth true
setPlaceMode -honorImplantSpacing true
setPlaceMode  -checkImplantMinArea true


